const STORE_CONFIG = {
  "PRODUCTS": {
    "19": {
      "name": "مودال 1",
      "price": 8400,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-19-1761774285629-modal7.jpg.webp",
      "description": "فستان سندريلا",
      "availableSizes": [
        "M",
        "S2"
      ],
      "availableColors": [
        "كما في الصورة"
      ]
    },
    "20": {
      "name": "مودال 2",
      "price": 6000,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-20-1761816208064-modle6.jpg",
      "description": "مودال أنيق",
      "availableSizes": [
        "S1",
        "S2",
        "M"
      ],
      "availableColors": [
        "كما في الصورة"
      ]
    },
    "21": {
      "name": "مودال 3",
      "price": 4000,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-21-1761838155562-modal5.jpg",
      "description": "مودال تركي بتفصيلات عصرية",
      "availableSizes": [
        "S1",
        "S2",
        "M",
        "L"
      ],
      "availableColors": [
        "كما في الصورة"
      ]
    },
    "22": {
      "name": "مودال 4",
      "price": 6000,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-22-1762006952336-modal12.jpg.webp",
      "description": "وصف المنتج الجديد",
      "availableSizes": [
        "S1",
        "S2",
        "M"
      ],
      "availableColors": [
        "كما في الصورة",
        "أبيض",
        "أسود",
        "رمادي"
      ]
    },
    "23": {
      "name": "مودال 5",
      "price": 5000,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-23-1762033027944-modal9.jpg.webp",
      "description": "وصف المنتج الجديد",
      "availableSizes": [
        "S1",
        "S2",
        "L"
      ],
      "availableColors": [
        "كما في الصورة",
        "زهري",
        "بنفسجي"
      ]
    },
    "24": {
      "name": "مودال 6",
      "price": 4000,
      "image": "https://raw.githubusercontent.com/Dz-Store/WER/main/images/product-24-1762236610689-modal11.jpg.webp",
      "description": "فستان الجميلات ، بتفاصيل دقيقة وجدابة",
      "availableSizes": [
        "S1",
        "S2",
        "S3",
        "S4",
        "M"
      ],
      "availableColors": [
        "كما في الصورة",
        "أبيض"
      ]
    }
  },
  "DELIVERY_PRICES": {
    "01 - أدرار": {
      "home": 1100,
      "desk": 600
    },
    "02 - الشلف": {
      "home": 700,
      "desk": 400
    },
    "03 - الأغواط": {
      "home": 1000,
      "desk": 600
    },
    "04 - أم البواقي": {
      "home": 650,
      "desk": 400
    },
    "05 - باتنة": {
      "home": 700,
      "desk": 400
    },
    "06 - بجاية": {
      "home": 700,
      "desk": 400
    },
    "07 - بسكرة": {
      "home": 900,
      "desk": 500
    },
    "08 - بشار": {
      "home": 1100,
      "desk": 600
    },
    "09 - البليدة": {
      "home": 500,
      "desk": 250
    },
    "10 - البويرة": {
      "home": 700,
      "desk": 400
    },
    "11 - تمنراست": {
      "home": 1300,
      "desk": 800
    },
    "12 - تبسة": {
      "home": 700,
      "desk": 400
    },
    "13 - تلمسان": {
      "home": 800,
      "desk": 400
    },
    "14 - تيارت": {
      "home": 800,
      "desk": 400
    },
    "15 - تيزي وزو": {
      "home": 700,
      "desk": 400
    },
    "16 - الجزائر": {
      "home": 500,
      "desk": 250
    },
    "17 - الجلفة": {
      "home": 900,
      "desk": 500
    },
    "18 - جيجل": {
      "home": 700,
      "desk": 400
    },
    "19 - سطيف": {
      "home": 700,
      "desk": 400
    },
    "20 - سعيدة": {
      "home": 800,
      "desk": 400
    },
    "21 - سكيكدة": {
      "home": 600,
      "desk": 400
    },
    "22 - سيدي بلعباس": {
      "home": 700,
      "desk": 400
    },
    "23 - عنابة": {
      "home": 700,
      "desk": 400
    },
    "24 - قالمة": {
      "home": 600,
      "desk": 400
    },
    "25 - قسنطينة": {
      "home": 600,
      "desk": 400
    },
    "26 - المدية": {
      "home": 700,
      "desk": 400
    },
    "27 - مستغانم": {
      "home": 700,
      "desk": 400
    },
    "28 - المسيلة": {
      "home": 800,
      "desk": 400
    },
    "29 - معسكر": {
      "home": 700,
      "desk": 400
    },
    "30 - ورقلة": {
      "home": 900,
      "desk": 500
    },
    "31 - وهران": {
      "home": 800,
      "desk": 400
    },
    "32 - البيض": {
      "home": 800,
      "desk": 500
    },
    "33 - إليزي": {
      "home": 1300,
      "desk": 600
    },
    "34 - برج بوعريريج": {
      "home": 700,
      "desk": 400
    },
    "35 - بومرداس": {
      "home": 700,
      "desk": 400
    },
    "36 - الطارف": {
      "home": 700,
      "desk": 400
    },
    "37 - تندوف": {
      "home": 1300,
      "desk": 600
    },
    "38 - تيسمسيلت": {
      "home": 800,
      "desk": 400
    },
    "39 - الوادي": {
      "home": 900,
      "desk": 500
    },
    "40 - خنشلة": {
      "home": 700,
      "desk": 500
    },
    "41 - سوق أهراس": {
      "home": 700,
      "desk": 400
    },
    "42 - تيبازة": {
      "home": 700,
      "desk": 400
    },
    "43 - ميلة": {
      "home": 700,
      "desk": 450
    },
    "44 - عين الدفلى": {
      "home": 700,
      "desk": 400
    },
    "45 - النعامة": {
      "home": 800,
      "desk": 500
    },
    "46 - عين تموشنت": {
      "home": 800,
      "desk": 400
    },
    "47 - غرداية": {
      "home": 900,
      "desk": 500
    },
    "48 - غليزان": {
      "home": 700,
      "desk": 400
    },
    "49 - تيميمون": {
      "home": 1100,
      "desk": 600
    },
    "50 - برج باجي مختار": {
      "home": 1200,
      "desk": 650
    },
    "51 - أولاد جلال": {
      "home": 900,
      "desk": 500
    },
    "52 - بني عباس": {
      "home": 1100,
      "desk": 600
    },
    "53 - عين صالح": {
      "home": 1300,
      "desk": 700
    },
    "54 - عين قزام": {
      "home": 1300,
      "desk": 700
    },
    "55 - توقرت": {
      "home": 950,
      "desk": 550
    },
    "56 - جانت": {
      "home": 1100,
      "desk": 500
    },
    "57 - المغير": {
      "home": 950,
      "desk": 550
    },
    "58 - المنيعة": {
      "home": 1000,
      "desk": 400
    },
    "59 - فرجيوة": {
      "home": 900,
      "desk": 500
    }
  },
  "DISCOUNTS": {
    "minQuantityForDiscount": 2,
    "discountPerItem": 400,
    "discountProducts": [
      20,
      21,
      22,
      23,
      24,
      19
    ],
    "discountScope": "selected"
  },
  "STORE_INFO": {
    "name": "BENAKRAB-Shopp",
    "tagline": "متجر أفخم الملابس",
    "phoneNumbers": [
      "0778506974",
      "0792946548"
    ],
    "storeIcon": "👗🛍️",
    "storeTitle": "أحدث موديلات الأطفال"
  },
  "AGE_SIZES": {
    "5": "S1",
    "6": "S2",
    "7": "S3",
    "8": "S4",
    "9": "M",
    "10": "M1",
    "11": "M2",
    "12": "L1"
  },
  "AVAILABLE_COLORS": [
    "كما في الصورة",
    "أبيض",
    "أسود",
    "رمادي",
    "أزرق",
    "أحمر",
    "أخضر",
    "زهري",
    "بنفسجي"
  ],
  "AVAILABLE_SIZES": [
    "S1",
    "S2",
    "S3",
    "S4",
    "M",
    "M1",
    "M2",
    "L1",
    "L2"
  ]
};